quantity = int(input("จำนวนปืน: "))
cost_price = int(input("ราคารับมาต่อกระบอก: "))
sell_price = int(input("ราคาขายต่อกระบอก: "))
team_members = int(input("จำนวนลูกน้อง: "))


ต้นทุนทั้งหมด = quantity * cost_price
รายรับ = quantity * sell_price
กำไร = รายรับ - ต้นทุนทั้งหมด
จำนวนเงินที่ถูกหักไปให้บอส = กำไร * 0.2
จำนวนเงินที่เหลือ = กำไร - จำนวนเงินที่ถูกหักไปให้บอส
จำนวนเงินที่ลูกน้องได้ = จำนวนเงินที่เหลือ / team_members

print("----------------------------")
print(f"ต้นทุนทั้งหมด {ต้นทุนทั้งหมด} บาท")
print(f"รายรับทั้งหมด {รายรับ} บาท")
print(f"กำไร {กำไร} บาท")
print(f"จำนวนเงินที่หักไปให้บอส {จำนวนเงินที่ถูกหักไปให้บอส}")
print(จำนวนเงินที่ลูกน้องได้)
print("-----------------------------")